---
kind: method
id: M:Autodesk.Revit.DB.Architecture.RoomFilter.#ctor
source: html/2307f473-d221-20ec-de56-732abeb69ebc.htm
---
# Autodesk.Revit.DB.Architecture.RoomFilter.#ctor Method

Constructs a filter which matches only rooms.

## Syntax (C#)
```csharp
public RoomFilter()
```